[
  {
    "id": "home-page",
    "title": "Home Page",
    "type": "content",
    "public": 1,
    "created_date": "2025-08-22",
    "last_edited_date": "2025-08-22",
    "content": "# Welcome to My Digital Life\n\nI'm Matt, a software engineer passionate about quantified self, transhumanism, and rationalism. This website is my experiment in \"living in public\" - sharing the data, metrics, and insights that shape my daily existence.\n\n## Current Focus\n\n- Building systems for personal optimization\n- Tracking and visualizing life metrics\n- Exploring the intersection of technology and human potential\n- Contributing to open source projects\n\n## Recent Achievements\n\n- Completed marathon training program\n- Maintained 90%+ habit consistency for 6 months\n- Launched 3 side projects\n- Read 24 books this year\n\n## Philosophy\n\nI believe in radical transparency, continuous improvement, and using data to understand ourselves better. This website is both a showcase of my work and a living experiment in personal documentation.\n\nExplore the various sections to see how I track habits, manage finances, monitor health metrics, and document my journey through life.",
    "metadata": "{\"file_path\": \"/home/ubuntu/repos/website/mock-obsidian/content/home-page.md\", \"aliases\": [], \"tags\": []}"
  },
  {
    "id": "about-this-site",
    "title": "About This Site",
    "type": "content",
    "public": 1,
    "created_date": "2025-08-22",
    "last_edited_date": "2025-08-22",
    "content": "# About This Site\n\nWelcome to my personal website - a comprehensive view into my quantified self journey and digital life.\n\nThis site represents my commitment to \"living in public\" by sharing the data, metrics, and insights that shape my daily existence. Every component you see here is powered by real data from my personal tracking systems, Obsidian vault, and various life metrics.\n\n## What You'll Find Here\n\n- **Quantified Self Dashboard**: Real-time metrics from my habits, health, finances, and productivity\n- **Interactive Visualizations**: Charts and graphs you can explore and comment on\n- **Personal Projects**: Documentation of my ongoing experiments and accomplishments\n- **Digital Garden**: My thoughts, notes, and ideas in an interconnected web\n\n## The Technology\n\nThis website follows a unique architecture where all content originates from markdown files in my Obsidian vault, gets processed by Python scripts, stored in a database, and then rendered through atomic React components. This ensures that everything you see reflects my actual lived experience and current thinking.\n\nFeel free to explore, interact with the data, and leave comments on any section that interests you!",
    "metadata": "{\"file_path\": \"/home/ubuntu/repos/website/mock-obsidian/content/about-this-site.md\", \"aliases\": [], \"tags\": []}"
  },
  {
    "id": "communities-i-am-a-part-of",
    "title": "Communities I Am A Part Of",
    "type": "content",
    "public": 1,
    "created_date": "2025-08-04",
    "last_edited_date": "2025-08-22",
    "content": "# Communities I Am a Part of\n\nWhen estimating size:\n\n- Personal affiliation: a 1 means barely affiliated, know about it, a 5 is interested, would describe myself as that label, a 10 is actively participate in that community\n\n| Community               | Description                                                                                        | Personal Affiliation | What I've Done                                                                                               |\n| ----------------------- | -------------------------------------------------------------------------------------------------- | -------------------- | ------------------------------------------------------------------------------------------------------------ |\n| Neovim                  | People that use Neovim for programming and enjoy customizing it                                    | 7                    | [dotfiles](https://github.com/MattHandzel/dotfiles/tree/main/nvim/.config/nvim)                             |\n| Polish Community        | People that speak Polish and are interested in Polish culture                                      | 8.5                  | [[poland-trip-summary.md]] ; Member of [Zagłoba Polish Club](https://www.instagram.com/zaglobapolishclub/) ; Performed at [Wigilia](https://www.youtube.com/watch?v=Cv3IAm9zr40) |\n| Keyboards               | People that use or are interested in ergonomic keyboards, mechanical keyboard, split keyboard      | 8                    | [Corne](https://github.com/MattHandzel/Corne)                                                               |\n| Optimizing productivity | People that enjoy optimizing their productivity                                                    | 2                    | Built personal productivity system with Obsidian                                                            |\n| Line Dancing            | People that enjoy line dancing and want to learn more about it                                     | 5                    | Attended weekly classes for 6 months                                                                        |\n| Running                 | People that run                                                                                    | 3.5                  | Completed 5K races, training for half marathon                                                              |\n| Quantified Self         | People that record information about themselves so they can improve it                             | 6                    | Built this personal website with habit tracking                                                             |\n| Lifelogging             | People that record everything about themselves                                                     | 5                    | Daily journaling and thought capture system                                                                 |\n| Rationalism             | People that are interested in rationality and improving their thinking                             | 4                    | Read Thinking Fast and Slow, practice CBT techniques                                                        |\n| AI Safety               | People that are interested in AI safety and ensuring AI is safe for humanity                       | 3                    | Following research, occasional donations                                                                     |\n| Founders                | People that start companies and have interests in entrepreneurship                                 | 3.5                  | Built several side projects, exploring startup ideas                                                        |\n| Don't Die               | People that are interested in living a long life and improving their health                        | 5                    | Regular health tracking, optimized sleep schedule                                                           |\n| Readers                 | People that read books and want to discuss them                                                    | 10                   | Read 50+ books annually, maintain reading notes                                                             |\n| Second Brain            | People that are interested in building a second brain and using tools like Obsidian                | 9                    | Built comprehensive PKM system with 1000+ notes                                                             |\n| The Residency           | People that want to build impressive and cool things without being limited by the public           | 3                    | Applied to program, following community updates                                                             |\n| Writers                 | People that write online and publish online                                                        | 4                    | Maintain personal blog, write technical articles                                                            |\n| Neuroscience            | People that are interested in neuroscience and how the brain works                                 | 3                    | Read popular science books, follow research                                                                 |\n| Longtermism             | People that are interested in longtermism and ensuring the future is good for humanity             | 5                    | Donate to longtermist causes, read EA content                                                               |\n| Y Combinator            | People that are interested in Y Combinator and the startup world                                   | 3                    | Follow YC content, applied to program                                                                       |\n| Philosophy              | People that are interested in philosophy and discussing philosophical ideas                        | 4                    | Read philosophy books, engage in discussions                                                                |\n| Bio Technology          | People that are interested in biotechnology and how it can be used to improve health and longevity | 3                    | Follow biotech news, interested in longevity research                                                       |\n| UIUC Alumni             | People that went to UIUC and want to connect with other alumni                                     | 7                    | Active in alumni network, attend events                                                                     |\n| Skydivers               | People that skydive and want to connect with other skydivers                                       | 3                    | Completed AFF course, 20+ jumps                                                                             |\n| Atheists                | People that don't believe in a religion                                                            | 8                    | Active in secular communities, read atheist literature                                                      |\n| Linux/GNU               | People that use Linux and GNU operating systems and want to connect with other users               | 6                    | Daily Linux user, contribute to open source                                                                 |\n| NixOS                   | People that use NixOS                                                                              | 5                    | Use NixOS for development, maintain dotfiles                                                                |\n| Effective Altruism      | People that want to do the most good with their life and resources                                 | 5                    | Regular donations, follow EA research                                                                       |",
    "metadata": "{\"file_path\": \"/home/ubuntu/repos/website/mock-obsidian/content/communities-i-am-a-part-of.md\", \"aliases\": [\"Communities I Am a Part of\", \"communities-i-am-a-part-of\"], \"tags\": []}"
  },
  {
    "id": "the-super-powers-you-get-without-a-phone",
    "title": "The Super Powers You Get Without A Phone",
    "type": "blog",
    "public": 1,
    "created_date": "2025-06-01",
    "last_edited_date": "2025-08-22",
    "content": "# The Super Powers You Get Without a Phone\n\n### Ideas\n\nWithout a phone, you have super-human focus.\nYou have a better understanding of your own feelings. You are able to sense when you feel tired better, estimate your state better. Your phone adds some noise to your internal measurements.\n\nMore social interactions, without a phone you are more inclined to talk to other people, even if this is 10% more often, the benefit will compound.\n\nI've ditched a smartphone and use a flip phone as my daily driver. Over the past few months of decreasing my dopamine baseline (listening to music, scrolling, being stimulated, porn, etc.) I've felt a fundamental change in my focus and how I spend my time. Very worthwhile.",
    "metadata": "{\"file_path\": \"/home/ubuntu/repos/website/mock-obsidian/notes/areas/personal-brand/blog/the-super-powers-you-get-without-a-phone.md\", \"aliases\": [\"The Super Powers You Get Without a Phone\", \"the-super-powers-you-get-without-a-phone\"], \"tags\": [], \"author\": \"Matt Handzel\", \"status\": \"draft\", \"reading_time_minutes\": 3, \"excerpt\": \"Discover the unexpected benefits of ditching your smartphone and using a flip phone instead.\", \"featured_image\": \"\", \"seo_title\": \"The Super Powers You Get Without a Phone - Focus and Social Benefits\", \"seo_description\": \"Learn how using a flip phone instead of a smartphone can improve your focus, social interactions, and internal awareness.\", \"revision_history\": [{\"date\": \"2025-06-01\", \"description\": \"Initial creation\"}, {\"date\": \"2025-08-22\", \"description\": \"Added ideas section\"}]}"
  }
]