[
  {
    "id": "get-jacked",
    "title": "Get Jacked",
    "description": "💪",
    "tags": [],
    "content": "# Get Jacked\n\n## What\n\nFor this project, my goal is get jacked. Specifically, I want to be at around 12% body fat, which means I would need to weigh around 170 lbs.\n\n## Why\n\n**Personal Challenge**: I was an obese kid growing up (at 13 years old, I was ~5'6 and 220 lbs). Since then, I've been conscious of my health and the impact that aesthetics have on my confidence and how others perceive me. Back then, I would have thought getting a 6-pack is _theoretically possible_, but I cannot imagine it on me.\n\n**Health**: I believe it is optimal to be at the 10-15% body fat range for longevity, energy, and general health. I also have asthma, and I've noticed that as my body fat decreases, the amount of asthma attacks I get also decreases.\n\n## How\n\n- I'm going on a [[whole-food-plant-based-diet-for-30-days | whole food plant based diet]] which I suppose will allow me to lose weight.\n- I'm _not_ going to do anything unsustainable (multi-day fasting, excessive cardio, etc). I want to be able to maintain this lifestyle long term.\n- I will lose ~1-2 lbs per week, and I will do strength training 3 times a week (Monday, Wednesday, Friday) to maintain muscle and do light cardio (walking, biking) on the other days.\n- If I do not lose weight after 1 week, I will track my calories for 3 days to get a better estimate of how much I am eating.\n- I will do intermittent fasting (16:8)\n\n## When\n\nIf I lose 1 lb per week, I will reach my goal in 13 weeks, which is January 13th, 2026.\n\n## Progress\n\n- 183 lbs as of 2025-10-14\n\n## Media\n\n## Reflection\n\n## Who Else",
    "public": 1,
    "created_date": "2025-10-14",
    "last_edited_date": "2025-10-14",
    "status": "active",
    "links": [],
    "metadata": {
      "file_path": "/home/matth/notes/projects/get-jacked/get-jacked.md",
      "folder_name": "get-jacked",
      "file_name": "get-jacked.md",
      "aliases": [
        "Get Jacked",
        "get-jacked"
      ]
    }
  },
  {
    "id": "knowledge-management-system",
    "title": "Knowledge Management System",
    "description": "A system I’m building to grow, organize, and express my knowledge over the next decade.",
    "tags": [],
    "content": "# Knowledge Management System\n\n## What\n\nFor this project, I’m building my own knowledge management system. I want something deeply integrated into my workflows and my other systems. It is inspired by the idea of a \"second brain\". I want to:\n\n- Be capable of capturing anything (text, images, links, audio, video) on any device. Sync everything so that it is accessible from any device.\n- Organize my information, having intelligent search and filters\n- Easily express my knowledge through writing, projects, and my website.\n- Constantly learn and remember what I've learned\n\n## Why\n\nA lot of my value comes from how I process information and make connections.  \nAugmenting this will directly increase the value I can provide, which leads to a better quality of life [[so-good-they-cant-ignore-you]].\nThere is nostalgic value in preserving my thoughts and ideas over time.\nFrom the perspective of AI, if I capture everything into my second brain, then I can leverage AI much more than someone who doesn't.\n\n## How\n\nI’m starting with my laptop since that’s where I spend most of my time and consume most of my information.\nI’ll build small tools that can run locally — first to capture, then to organize, then to distill, and finally to express.\nBecause I already tag everything, I can make it programmatic — for example:\n\n- If something is tagged `todo`, it can automatically sync to Taskwarrior.\n- If it’s tagged `reading-list`, it can go into my RSS feed.\n\nEventually, I’ll connect it to my website so that some parts of my second brain can be accessed publicly.\n\n## When\n\nI will build an end-to-end MVP running by December 31st 2025.\n\n## Progress\n\n- [x] Built initial capture prototype — [GitHub Repo](https://github.com/MattHandzel/KnowledgeManagementSystem/)\n- [x] Build local tagging + metadata indexing\n- [ ] Integrate AI for tagging\n- [ ] Integrate AI for summarization\n- [ ] Create interface for organizing it within Neovim\n\n## Media\n\n- [GitHub Repository](https://github.com/MattHandzel/KnowledgeManagementSystem/)\n\n## Reflection\n\n## Who Else\n\nInspired by Tiago Forte, Nick Milo, and the PKM community.  \nAlso influenced by developers building open, local-first knowledge systems.",
    "public": 1,
    "created_date": "2025-10-08",
    "last_edited_date": "2025-10-15",
    "status": "active",
    "links": [
      "https://github.com/MattHandzel/KnowledgeManagementSystem/"
    ],
    "metadata": {
      "file_path": "/home/matth/notes/projects/knowledge-management-system/knowledge-management-system.md",
      "folder_name": "knowledge-management-system",
      "file_name": "knowledge-management-system.md",
      "aliases": [
        "Knowledge Management System",
        "knowledge-management-system"
      ]
    }
  },
  {
    "id": "longevity-biotech-fellowship",
    "title": "Longevity Biotech Fellowship",
    "description": "10 week fellowship to make tangible personal progress in the field of longevity biotechnology.",
    "tags": [],
    "content": "## What\n\n\"The Longevity Biotech Fellowship (LBF) is a community of hardcore Longevity Accelerationists. Our members build, join, and invest in revolutionary biotechnology projects for radical life extension.\" The LBF had a kickoff in Cofrentes, Spain on September 22nd, 2025. The fellowship is a ten-week program aimed at making tangible _personal_ progress in the field of longevity biotechnology with a personal demo day on December 14th, 2025.\n\nFor this fellowship, my goal is to:\n\n- Solve a real problem for at least 1 person in the LBF. Supporting scientists, CEOs, improving their {creativity, productivity, searching, exploring, networking}.\n\n## Why\n\nI joined the LBF because I want to spend my life working on something that has high impact for a lot of people. Aging impacts everyone on a personal level, and it impacts society as a whole, so I want to explore if solving problems in the realm of longevity is my Ikigai. My specific goal of solving a problem for at least one person is I want to improve my agency, and learn how to make something that others want. I also believe at my current skillset, I cannot solve the \"hard\" problems, but I can do a support those that are solving the hard problems.\n\n## How\n\nBy reaching out to people who I've met at LBF7 or in the Slack, ask them what problems they have that I am capable of solving and is aligned with my studies.\nDraft up a project proposal and share it with whomever I am working with to get feedback and iterate on it.\nSpend no more than 3 hours per week working on this project, as I have other commitments (university, job search, etc).\nHave Scrum-like sprints once I have the MVP\n\n## When\n\nMake a MVP to solve their problem by November 2nd, 2025\nHave 4 rounds of iteration and feedback by December 7th, 2025\nPost the finished project by December 14th, 2025\n\n## Progress\n\n- [x] Post this “mission/goal” on the LBF Slack to “find” problems.\n- [x] Reach out to those that have a company or are doing interesting work in the LBF Slack\n- [x] Message 5 people to solicit for problems they have/project ideas\n- [ ] Compile all of the \"user interviews\" I've conducted into a document\n- [ ] Brainstorm solutions for these people's problems\n- [ ] Write a project proposal for a maximum of 1 hour\n- [ ] Send it to stakeholders\n\n## Media\n\n## Reflection\n\nI've noticed I have a fear of asking people to help them. This is quite irrational as I am trying to help them, but I think it stems from a fear of failure.\n\n## Who Else",
    "public": 1,
    "created_date": "2025-10-08",
    "last_edited_date": "2025-10-14",
    "status": "active",
    "links": [],
    "metadata": {
      "file_path": "/home/matth/notes/projects/longevity-biotech-fellowship/longevity-biotech-fellowship.md",
      "folder_name": "longevity-biotech-fellowship",
      "file_name": "longevity-biotech-fellowship.md",
      "aliases": [
        "Longevity Biotech Fellowship",
        "longevity-biotech-fellowship"
      ]
    }
  },
  {
    "id": "whole-food-plant-based-diet-for-30-days",
    "title": "Whole Food Plant Based Diet For 30 Days",
    "description": "",
    "tags": [],
    "content": "# Whole Food Plant Based Diet for 30 Days\n\n## What\n\nFor 30 days I will be moving towards eating a whole food plant based diet based on [[how-not-to-die|How Not to Die]]. This means I will make an effort to remove the following from my diet:\n\n- Meat\n- Dairy\n- Processed food\n- Added sugar\n- Oils\n\nI will not be perfect. I will allow myself to eat some processed food like Huel[^1] and I might purchase something I didn't know had added sugar but I will be eating more and more pure as this month continues.\n\n## Why\n\nI want to see what effect having a very \"clean\" diet will have on my health, energy, and mood.\nI want to experience everything there is to experience in life. Now when someone tells me they are vegan or vegetarian, we can bond over this shared experience.\n\n## How\n\nI will not buy anything that is not whole food plant based. I tend not to eat out already.\nIf I feel a negative difference in mood, health, and energy then I will stop this experiment.\nI will take a multi-vitamin daily to get B12 and eat a lot of lentils, almonds, soy milk, and broccoli to maintain calcium.\nIf I am out with friends and there is nothing I can eat, I will eat what is available. I will not sacrifice social time for this diet.\n\n## When\n\nFrom 2025-10-15 to 2025-11-14 I will maintain this diet.\n\n## Media\n\n## Reflection\n\nI did not realize that lentils actually taste very good! Tofu tastes good with soy sauce.\nI think a hard part about this diet is getting over the belief that meat needs to be a part of every meal.\nI also didn't know some foods like edameme have a good protein carb ratio.\nIt's only 1 day in and it seems quite easy to eat like this.\nThe only thing I am worried about is maintaining my muscle as I lose weight.\nI've learned how to cook new dishes, which maintains novelty, which is a good reason to do these challenges!\n\n## Who Else\n\nI have tricked my roommate to doing a two-week vegetarian challenge.\n\n[^1]: I have ~150$ worth of Huel that I need to eat before the end of the year. I might not always have time to cook.",
    "public": 1,
    "created_date": "2025-10-14",
    "last_edited_date": "2025-10-15",
    "status": "active",
    "links": [],
    "metadata": {
      "file_path": "/home/matth/notes/projects/whole-food-plant-based-diet-for-30-days/whole-food-plant-based-diet-for-30-days.md",
      "folder_name": "whole-food-plant-based-diet-for-30-days",
      "file_name": "whole-food-plant-based-diet-for-30-days.md",
      "aliases": [
        "Whole Food Plant Based Diet for 30 Days",
        "whole-food-plant-based-diet-for-30-days"
      ]
    }
  }
]