{
  "title": "Standards",
  "content": "# Standards\n\nThis is a document where I have put all of my standards for different areas of my life. These are the minimum acceptable levels of performance or behavior that I expect from myself. By adhering to these standards, I aim to improve my overall quality of life and achieve my goals.\n\n## Minimum Standards\n\n### Health\n\n- I never eat junk food (muffins, cakes, chips, candy, soda, etc)\n- I do 16:8 intermittent fasting\n- I do not eat food 2 hours before bed, even if I am hungry. Hunger will pass.\n- I do strength training 2x per week and running 1x per week\n- When eating alone, I end my meals within 45 minutes of starting them.\n\n### Work\n\n- I identify my most important task the night before\n- I work on my most important task for the first 30 minutes of my workday. [[essentialism]]\n- I get out of bed within 10 minutes of waking up\n- I say no to meetings without an agenda or decision owner.\n\n### Digital Hygiene\n\n- Algorithmic feeds are blocked by default on all my devices\n- No phone in bedroom 1 hour before going to bed.\n- No music, podcasts, or videos when working. Only ambient noise or silence.\n- No more than 10 minutes of listening to music per day.\n\n### Relationships\n\n- I respond within 2 weeks to every message sent\n- I always wish people a happy birthday on their birthdays\n- I default to voice/video for conflict; no arguing over text.\n- I never gossip; I address issues directly with the person first.\n- I leave events early if I am not enjoying myself.\n\n### Misc\n\n- I do a systems iteration session once a week.\n\n<!-- ## Exceptional standards -->\n<!---->\n<!-- - once a month fast 3 days a week (Outlive) -->\n<!-- I capture ideas instantly (voice/text) and inbox-zero my notes weekly. -->\n<!-- - Everything I own has a home; I keep surfaces mostly empty. -->\n<!-- - I keep a ready-to-go travel kit and gym bag. I have mutliple of things so i never forget them -->\n<!-- - I can never be upset when someone asks me for help. -->\n<!-- - I can never be upset if someone breaks an unspoken rule -->\n<!-- I write a 5-line decision memo for choices >$500 or >5 hours. -->",
  "created_date": "2025-10-19",
  "last_edited_date": "2025-10-19"
}